puts "Добро пожаловать в наш бар!"
puts "Как Вас зовут?"
name = gets.chomp
puts "Привет, "+name.capitalize+"."
if name ==  "Sergey" 
	puts "Что моему Повелителю угодно?"
end
if name == "Kirill"
		puts "Привет, братишка! Чего желаешь?"
end	
if name == "Ivan"
	puts "Я полагаю, Вам как всегда, шот текиллы?"
end
	if name != "Ivan" or name != "Kirill" or name != "Sergey"
		
	puts "О, так у нас новый посетитель! Вот Вам винная карта, выбирайте!"
	
str = '--> text <--'
puts "Винная карта".center 150
выберите интересующий вас раздел
vibor = gets.chomp
пиво разливное (a)
Амстел, светлое, 3,8 градуса
пиво бутылочное(b)
шампанское(c)
игристые вина(d)
сидр(e)
белые вина(f)
красные вина(g)
розовое вино(h)
аперетив(i)
дижестив(j)
виски(k)
puts "текилла".ljust(40/2) + "200".rjust(40/2)(l)
puts "коньяк".ljust(40/2) + "200".rjust(40/2)(m)
puts str.rjust 02бренди(n)
puts str.ljust (02) ром(o)
puts str.rjust (20)джин(p)
водка(q)
портвейн (r)
ликёры(s)
алкогольные коктейли(t)
шоты(u)
безалкогольные напитки(v)
сок свежевыжатый(w)
безалкогольные коктейли(x)
кофе(y)
		
	end